#+TITLE:  Emacs
#+AUTHOR: Malcolm Kahora
#+BEAMER_HEADER: \institute{The Changelog}
#+PROPERTY: comments yes
#+PROPERTY: header-args :exports both :eval never-export
#+OPTIONS: H:2
#+BEAMER_THEME: CambridgeUS
#+BEAMER_COLOR_THEME: default
#+BEAMER_HEADER: \AtBeginSection{\frame{\sectionpage}}

***** org babel

- c-code

#+begin_src C

  for (int i = 0; i < 20; i+=2) {

  printf("%d ", i);

  }

#+end_src

#+RESULTS:
: 0 2 4 6 8 10 12 14 16 18

- python
  
  #+begin_src python :results output

for x in "banana":
  print(x) 

  #+end_src

  #+RESULTS:
  : b
  : a
  : n
  : a
  : n
  : a


